### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.backend_func.module.cdc_backend_func.azurerm_linux_function_app_slot.this[0] has changed
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Web/sites/io-p-itn-cdc-backend-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                                   = "CDC"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CDC"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (32 unchanged attributes hidden)

      ~ identity {
          ~ principal_id = "a8b9042b-d1c7-422d-87d0-2f801ae983df" -> "d3711370-e4ac-42c3-badc-869df40f6157"
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.backend_func.module.cdc_backend_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "AzureFunctionsWebHost__hostid"                                                                    = "staging"
          ~ "SLOT_TASK_HUBNAME"                                                                                = "ProductionTaskHub" -> "StagingTaskHub"
            # (48 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Web/sites/io-p-itn-cdc-backend-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                                   = "CDC"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CDC"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.backend_func.module.cdc_backend_func.azurerm_role_assignment.staging_function_storage_account_contributor[0] must be replaced
-/+ resource "azurerm_role_assignment" "staging_function_storage_account_contributor" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncdcbackendstfn01/providers/Microsoft.Authorization/roleAssignments/e257c3ac-9e65-f2c1-feb4-b51956789883" -> (known after apply)
      ~ name                                   = "e257c3ac-9e65-f2c1-feb4-b51956789883" -> (known after apply)
      ~ principal_id                           = "a8b9042b-d1c7-422d-87d0-2f801ae983df" -> "d3711370-e4ac-42c3-badc-869df40f6157" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.backend_func.module.cdc_backend_func.azurerm_role_assignment.staging_function_storage_blob_data_owner[0] must be replaced
-/+ resource "azurerm_role_assignment" "staging_function_storage_blob_data_owner" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncdcbackendstfn01/providers/Microsoft.Authorization/roleAssignments/c77c29a8-851d-8d1f-2c73-ade643bca682" -> (known after apply)
      ~ name                                   = "c77c29a8-851d-8d1f-2c73-ade643bca682" -> (known after apply)
      ~ principal_id                           = "a8b9042b-d1c7-422d-87d0-2f801ae983df" -> "d3711370-e4ac-42c3-badc-869df40f6157" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.backend_func.module.cdc_backend_func.azurerm_role_assignment.staging_function_storage_queue_data_contributor[0] must be replaced
-/+ resource "azurerm_role_assignment" "staging_function_storage_queue_data_contributor" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncdcbackendstfn01/providers/Microsoft.Authorization/roleAssignments/fa118c82-ba23-a0a0-b4dd-125d3fd912e9" -> (known after apply)
      ~ name                                   = "fa118c82-ba23-a0a0-b4dd-125d3fd912e9" -> (known after apply)
      ~ principal_id                           = "a8b9042b-d1c7-422d-87d0-2f801ae983df" -> "d3711370-e4ac-42c3-badc-869df40f6157" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/974c5e8b-45b9-4653-ba55-5f855dd0fb88" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.
```

</details>
